Revit 2018 API
BuiltInFailures.SectionViewFailures.SectionAndScopeBoxNotOrtho Property
 Section must be parallel to one side of the associated scope box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public static FailureDefinitionId SectionAndScopeBoxNotOrtho { get; }
Visual Basic
Public Shared ReadOnly Property SectionAndScopeBoxNotOrtho As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SectionAndScopeBoxNotOrtho {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SectionViewFailures Class
Autodesk.Revit.DB Namespace